tutorials/multiphase/interCondensatingEvaporatingFoam/condensatingVessel/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (liquid vapour); // FC-72


sigma           0;

liquid
{
    transportModel  Newtonian;
    nu              2.64e-7;
    rho             1583.4;


    Cp              1.1072e3;
    Cv              1.1072e3;   // assume Cp for liquid
    kappa           0.057;
    hf              0;
}

vapour
{
    transportModel  Newtonian;
    nu              5e-7;
    rho             14.9;


    Cp              895.2;      // FC72 vapour
    Cv              870.4;      // Cv = Cp - R/w
    kappa           0.01;       // FC72 vapour
    hf              93.0e3;
}

Prt             0.7;

// ************************************************************************* //
